Bwooce/tinygs_nRF52/src/main.cpp
/* -------------------------------------------------------------------------- */
/* MQTT Event Handler                                                          */
/* -------------------------------------------------------------------------- */

static void mqtt_evt_handler(struct mqtt_client *client, const struct mqtt_evt *evt)
{
    switch (evt->type) {
    case MQTT_EVT_CONNACK:
        if (evt->result == 0) {
            LOG_INF("MQTT CONNECTED to %s:%d", MQTT_BROKER_HOSTNAME, MQTT_BROKER_PORT);
            app_state = STATE_MQTT_CONNECTED;
        } else {
            LOG_ERR("MQTT CONNACK error: %d", evt->result);
            app_state = STATE_ERROR;
        }
        break;

    case MQTT_EVT_DISCONNECT:
        LOG_WRN("MQTT disconnected: %d", evt->result);
        app_state = STATE_ERROR;
        break;

    case MQTT_EVT_PUBLISH: {
        const struct mqtt_publish_param *pub = &evt->param.publish;
        LOG_INF("MQTT PUBLISH on topic len=%u, payload len=%u",
                pub->message.topic.topic.size,
                pub->message.payload.len);
        break;
    }

    case MQTT_EVT_SUBACK:
        LOG_INF("MQTT SUBACK id=%u result=%d",
                evt->param.suback.message_id, evt->result);
        break;

    default:
        LOG_DBG("MQTT event: %d", evt->type);
        break;
    }
}

/* -------------------------------------------------------------------------- */
/* MQTT-TLS Connection                                                         */
/* -------------------------------------------------------------------------- */

/* Raw TCP connectivity test — isolates TCP from TLS/MQTT */
static int test_tcp_connect(void)
{
    char addr_str[INET6_ADDRSTRLEN];
    struct sockaddr_in6 *sin6 = (struct sockaddr_in6 *)&broker_addr;

    net_addr_ntop(AF_INET6, &sin6->sin6_addr, addr_str, sizeof(addr_str));
    LOG_INF("TCP test: connecting to [%s]:%d ...",
            addr_str, ntohs(sin6->sin6_port));

    int sock = zsock_socket(AF_INET6, SOCK_STREAM, IPPROTO_TCP);
    if (sock < 0) {
        LOG_ERR("TCP test: socket() failed: %d", errno);
        return -1;
    }

    /* Set a 30s connect timeout — Thread mesh can be slow */
    struct timeval tv = { .tv_sec = 30 };
    zsock_setsockopt(sock, SOL_SOCKET, SO_RCVTIMEO, &tv, sizeof(tv));
    zsock_setsockopt(sock, SOL_SOCKET, SO_SNDTIMEO, &tv, sizeof(tv));

    int ret = zsock_connect(sock, (struct sockaddr *)sin6, sizeof(*sin6));
    if (ret < 0) {
        LOG_ERR("TCP test: connect() failed: %d (errno=%d)", ret, errno);
        zsock_close(sock);
        return -1;
    }

    LOG_INF("=== TCP CONNECT SUCCEEDED! ===");
    zsock_close(sock);
    return 0;
}

static int mqtt_tls_connect(void)
{
    LOG_INF("Connecting MQTT-TLS to proxy port %d ...", MQTT_PROXY_PORT);

    mqtt_client_init(&mqtt_client);

    /* Broker address — use proxy port */
    struct sockaddr_in6 *sin6 = (struct sockaddr_in6 *)&broker_addr;
    sin6->sin6_port = htons(MQTT_PROXY_PORT);
    mqtt_client.broker = &broker_addr;

    /* Client ID and credentials */
    mqtt_client.client_id.utf8 = (uint8_t *)MQTT_CLIENT_ID;
    mqtt_client.client_id.size = strlen(MQTT_CLIENT_ID);

    static struct mqtt_utf8 username = {
        .utf8 = (uint8_t *)MQTT_USERNAME,
        .size = sizeof(MQTT_USERNAME) - 1,
    };
    static struct mqtt_utf8 password = {
        .utf8 = (uint8_t *)MQTT_PASSWORD,
        .size = sizeof(MQTT_PASSWORD) - 1,
    };
    mqtt_client.user_name = &username;
    mqtt_client.password = &password;

    /* Buffers */
    mqtt_client.rx_buf = mqtt_rx_buf;
    mqtt_client.rx_buf_size = sizeof(mqtt_rx_buf);
    mqtt_client.tx_buf = mqtt_tx_buf;
    mqtt_client.tx_buf_size = sizeof(mqtt_tx_buf);

    /* Event handler */
    mqtt_client.evt_cb = mqtt_evt_handler;

    /* Plain TCP for now — socat on BR handles TLS to mqtt.tinygs.com.
     * MQTT_TRANSPORT_SECURE with sec_tag_count=0 returns EHOSTUNREACH (-113)
     * which appears to be a Zephyr TLS socket creation bug on Thread.
     * TODO: Fix TLS socket over Thread or use socat OPENSSL bridge. */
    mqtt_client.transport.type = MQTT_TRANSPORT_NON_SECURE;

    LOG_INF("Starting TLS handshake (this is the RAM crunch moment)...");

    int ret = mqtt_connect(&mqtt_client);
    if (ret != 0) {
        LOG_ERR("mqtt_connect() failed: %d", ret);
        return ret;
    }

    LOG_INF("mqtt_connect() returned OK, waiting for CONNACK...");
    return 0;
}

/* -------------------------------------------------------------------------- */
/* USB MSC & FATFS                                                             */
/* -------------------------------------------------------------------------- */

static FATFS fat_fs;
static struct fs_mount_t mp = {
    .type = FS_FATFS,
    .mnt_point = "/NAND:",
    .fs_data = &fat_fs,
};

static const char *html_content =
    "<!DOCTYPE html><html><head><title>TinyGS Configurator</title>"
    "<style>body{font-family:sans-serif;max-width:600px;margin:40px auto;padding:20px;background:#f4f4f9;}"
    ".card{background:white;padding:20px;border-radius:8px;box-shadow:0 2px 4px rgba(0,0,0,0.1);}"
    "input{width:100%;padding:8px;margin:8px 0;box-sizing:border-box;border:1px solid #ccc;border-radius:4px;}"
    "button{background:#5a67d8;color:white;border:none;padding:10px 20px;border-radius:4px;cursor:pointer;width:100%;font-size:16px;}"
    "button:hover{background:#434190;}</style>"
    "</head><body>"
    "<div class='card'>"
    "<h1>TinyGS Setup</h1>"
    "<p>Configure your Ground Station and join the Thread network.</p>"
    "<hr>"
    "<label>Station ID:</label><input type='text' id='station' placeholder='MyTinyGS'>"
    "<label>MQTT Password:</label><input type='password' id='pass' placeholder='Password'>"
    "<br><br>"
    "<button onclick='saveConfig()'>Save config.json to Drive</button>"
    "<p style='font-size:0.8em;color:#666;'>After saving, scan the QR code in Home Assistant to finish setup.</p>"
    "</div>"
    "<script>"
    "function saveConfig() {"
    "  const config = {"
    "    station: document.getElementById('station').value,"
    "    password: document.getElementById('pass').value"
    "  };"
    "  const blob = new Blob([JSON.stringify(config, null, 2)], { type: 'application/json' });"
    "  const a = document.createElement('a');"
    "  a.href = URL.createObjectURL(blob);"
    "  a.download = 'config.json';"
    "  a.click();"
    "}"
    "</script>"
    "</body></html>";

static void setup_usb_storage(void)
{
    struct fs_file_t file;
    struct fs_dirent entry;

